Revit 2027 API
IExternalDataManagerServer.GetTitle Method
 Obtains the title for the external data.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetTitle()
Function GetTitle As String
String^ GetTitle()
abstract GetTitle : unit -> string
Return Value
String
Remarks
 The title is shown as the header text of the Manage Links UI. It should be concise (ideally one or two words) and fully localized. Revit calls this once per server instance when the dialog is opened; the value may be cached on the UI side until the dialog is closed.
See Also
Reference
IExternalDataManagerServer Interface
Autodesk.Revit.UI Namespace